local function run(msg, matches)
local permagbot = [[
📋 راهنمای مدیریتی 📋

➖➖➖➖➖➖ 

🖊 ادمین ها 
📢 لیست ادمین های گروه
➖➖➖➖➖➖
🖊 صاحب گروه
📢 نمایش صاحب ربات در گروه
➖➖➖➖➖➖
🖊 مدیران
📢 لیست مدیران رابات
➖➖➖➖➖➖
🖊 ربات ها
📢 لیست ربات های گروه
➖➖➖➖➖➖
🖊 افراد
📢 لیست کاربران گروه 
➖➖➖➖➖➖
🖊 اخراجی ها
📢 لیست افراد اخراج شده از گروه
➖➖➖➖➖➖
🖊 ایدی
📢 دریافت کدتان 
📢 با اضافه کردن ایدی شخص کد شخص را دریافت میکنید .
➖➖➖➖➖➖
🖊 ترفیع
📢 ترفیع کاربر به مدیر ربات 
➖➖➖➖➖➖
🖊 عزل
📢 عزل مدیر 
➖➖➖➖➖➖
🖊 تنظیم قوانین
📢 تنظیم قوانین برای گروه
➖➖➖➖➖➖
🖊 قوانین
📢نمایش قوانین گروه
➖➖➖➖➖➖
🖊 صاحب
📢 ترفیع کاربر به صاحب ربات در گروه
➖➖➖➖➖➖
🖊 لینک
📢 ارسال لینک گروه
➖➖➖➖➖➖
🖊 تنظیم لینک
📢 لینک رو بعد از درست کردن به ربات بدهید .
➖➖➖➖➖➖
🖊 تبدیل
📢 تبدیل گروه به سوپر گروه
➖➖➖➖➖➖
🖊 اخراج
📢 اخراج کاربر از گروه 
➖➖➖➖➖➖
🖊 بن
📢 اخراج و بن کردن کاربر
➖➖➖➖➖➖
🖊 رفع بن
📢 خارج کردن کاربر از لیست بن
➖➖➖➖➖➖
🖊 لیست بن
📢 لیست افراد بن شده 
➖➖➖➖➖➖
🖊 فعالان گروه
📢 لیست فعالان گروه
➖➖➖➖➖➖
🖊 بازنگری
📢 برای اعمال اپدیت های جدید 
➖➖➖➖➖➖
🖊 تنظیم خوش امدگویی
📢 متن را بعد دستور بنویسید 
➖➖➖➖➖➖
🖊 حذف خوش امدگویی
📢 حذف متن خوش امد گویی
➖➖➖➖➖➖
🖊 زمان
📢 نمایش زمان هر منطقه
➖➖➖➖➖➖
🖊 دعوت
📢 دعوت کاربر به گروه
➖➖➖➖➖➖
🖊 اخراج با فوروارد
📢 اخراج کاربر با فوروارد کردن پیام هر کاربر
➖➖➖➖➖➖
🏵 @SKORT_TM🏵
]]
local permagbot1 = [[
📋 راهنمای قفلی 📋

➖➖➖➖➖➖ 

🖊 قفل لینک
🖊 بازکردن لینک
➖➖➖➖➖➖
🖊 قفل تبلیغات
🖊 بازکردن  تبلیغات
➖➖➖➖➖➖
🖊 قفل تگ
🖊 بازکردن تگ
➖➖➖➖➖➖
🖊 قفل یوزرنیم
🖊 بازکردن یوزرنیم
➖➖➖➖➖➖
🖊 قفل ربات
🖊 بازکردن ربات
➖➖➖➖➖➖
🖊 قفل دستورات
🖊 بازکردن دستورات 
➖➖➖➖➖➖
🖊 قفل اسپم
🖊 بازکردن اسپم 
➖➖➖➖➖➖
🖊 قفل فلود
🖊 بازکردن فلود 
➖➖➖➖➖➖
🖊 حساسیت (5-25)
🖊 مثال : حساسیت 5
➖➖➖➖➖➖
🖊 قفل انگلیسی
🖊 بازکردن  انگلیسی
➖➖➖➖➖➖
🖊 قفل اعضا
🖊 بازکردن اعضا
➖➖➖➖➖➖
🖊 قفل سیستم
🖊 بازکردن سیستم
➖➖➖➖➖➖
🖊 قفل استیکر
🖊 بازکردن استیکر
➖➖➖➖➖➖
🖊 قفل فوروارد
🖊 بازکردن فوروارد
➖➖➖➖➖➖
🖊 قفل سختگیرانه
🖊 بازکردن سختگیرانه 
➖➖➖➖➖➖
🖊 قفل مخاطب
🖊 بازکردن  مخاطب
➖➖➖➖➖➖
🖊 قفل شکلک
🖊 بازکردن  شکلک
➖➖➖➖➖➖
🖊 قفل ممبر
🖊 بازکردن  ممبر
➖➖➖➖➖➖
🖊 قفل مدیا
🖊 بازکردن  مدیا
➖➖➖➖➖➖
🖊 قفل ریپلی
🖊 بازکردن  ریپلی
➖➖➖➖➖➖
🖊 قفل اپراتور
🖊 بازکردن  اپراتور
➖➖➖➖➖➖
🖊 سکوت
🖊 رفع سکوت
🖊 لیست سکوت
➖➖➖➖➖➖
🖊 قفل گروه c b a
🖊 بازکردن گروه
📢 مثال : گروه 1 2 3 = 1 ساعت 2 دقیقه 3 ثانیه
➖➖➖➖➖➖
🖊 قفل صدا
🖊 بازکردن صدا
➖➖➖➖➖➖
🖊 قفل عکس
🖊 بازکردن عکس
➖➖➖➖➖➖
🖊 قفل فیلم
🖊 بازکردن فیلم
➖➖➖➖➖➖
🖊 قفل گیف
🖊 بازکردن گیف
➖➖➖➖➖➖
🖊 قفل فایل
🖊 بازکردن فایل
➖➖➖➖➖➖
🖊 قفل متن
🖊 بازکردن متن
➖➖➖➖➖➖
🖊 قفل همه
🖊 بازکردن همه
➖➖➖➖➖➖
🏵 @SKORT_TM🏵
]]
local permagbot2 = [[
📋 راهنمای پاکسازی 📋

➖➖➖➖➖➖ 

🖊 حذف دیلیت اکانتی ها
📢 پاک کردن اکانت های دیلیت شده از لیست گروه .
➖➖➖➖➖➖
🖊 پاکسازی مدیران
📢 لیست مدیران ربات پاک خواهد شد .
➖➖➖➖➖➖
🖊 پاکسازی قوانین
📢 قوانین گروه پاک خواهد شد . 
➖➖➖➖➖➖
🖊 پاکسازی توضیحات
📢 توضیحات گروه پاک خواهد شد .
➖➖➖➖➖➖
🖊 پاکسازی لیست سکوت
📢 لیست سکوت پاک خواهد شد .
➖➖➖➖➖➖
🖊 پاکسازی ربات ها
📢 ربات ها پاک خواهند شد .
➖➖➖➖➖➖
🏵 @SKORT_TM🏵
]]

local permagbot3 = [[
🔆 راهنمای ربات 🔆

💫 دستورات و راهنمای کامل ربات 

💎 دستورات مدیریتی ✨
🔮 راهنمای مدیریتی

💎 دستورات قفلی ✨
🔮 راهنمای قفلی

💎 دستورات پاکسازی ✨
🔮 راهنمای پاکسازی

💎 پشتیبانی فنی ✨
🔮 پشتیبانی

💎 مشاهده لیست تنظیمات گروه ✨
🔮 تنظیمات

💎 مشاهده لیست تنظیمات فایلی ✨
🔮 لیست فایلها

➖➖➖➖➖➖
🏵 @SKORT_TM🏵
]]

local permagbot4 = [[
🔆 پشتیبانی ربات 🔆

💫 لطفا قبل از هر سوال اول کانال ما را کامل مطالعه کنید . 💫

✨ لینک کانال پشتیبانی ✨
🏵 @SKORT_TM🏵

✨ لینک گروه پشتیبانی ✨
🏵 https://telegram.me/joinchat/DayKVkDVZJiicDYllvL9DQ 🏵

✨ ربات ارتباط با پشتیبانی ✨
🏵 SKORTTM_BOT 🏵
]]
    if matches[1] == 'راهنمای مدیریتی' and is_momod(msg) then
        return permagbot  
  elseif matches[1] == 'راهنمای قفلی' and is_momod(msg) then
		return permagbot1
  elseif matches[1] == 'راهنمای پاکسازی' and is_momod(msg) then
		return permagbot2
  elseif matches[1] == 'help' and is_momod(msg) or matches[1] == 'راهنما' and is_momod(msg) then
		return permagbot3
  elseif matches[1] == 'پشتیبانی' and is_momod(msg) then
		return permagbot4
  end
end

return {
      description = '',
      usage = '',
      patterns = {
    '^(راهنمای مدیریتی)$',
    '^(راهنمای قفلی)$',
	'^(راهنمای پاکسازی)$',
    '^(help)$',
    '^(راهنما)$',
    '^(پشتیبانی)$',
      },
      run = run,
}
